{"id":"119","content":"Atma/Aatma","details":"Literally soul. Means the spirit in every living thing not just humans. "}
{"id":"118","content":"Preya","details":"sensual immediate gratification"}
{"id":"117","content":"Brahman/Brahmin","details":"JSON (JavaScript Object Notation) is a lightweight data-interchange format. It is easy for humans to read and write. It is easy for machines to parse and generate. An example {{'firstName':'Inigo '},{ 'lastName':'Montoya'}}"}
{"id":"116","content":"Bhagavad Geeta/Gita","details":"Enterprise Java Beans consist of Entity Beans, Session Beans and Message Beans which execute on application servers."}
{"id":"115","content":"Shreya","details":"Entity Relation Diagram describes inter-related things of interest in a specific domain of knowledge. An ER model is composed of entity types (which classify the things of interest) and specifies relationships that can exist between instances of those entity types."}
{"id":"114","content":"Jyothi","details":"JSON Web Token (JWT) is an open standard (RFC 7519) that defines a compact and self-contained way for securely transmitting information between parties as a JSON object"}
{"id":"113","content":"Deep","details":"Java Virtual Machine which runs on all operating systems. Applications written in languages compatible in JVM execute seamlessly in any operating systems"}
{"id":"112","content":"Gnayn","details":"Single Log On (SLO) allows a user be authenticated to various applications in a network without signing in with uid and password.As opposed to Single Sign On this doesnot include authorization  "}
{"id":"111","content":"Vidya","details":"Single Sign On (SSO) allows a user to logon to various applications in a network without signing in with uid and password. Authentication and authorization is done via a directory server which is separate from application and web server.  "}
{"id":"0","content":"Vijaya","details":"ADA is a machine level language named after the first programmer Ada. Ada was the coder for Charles Babbage"}
{"id":"1","content":"Chinta","details":"ACID (Atomicity, Consistency, Isolation, Durability) is a set of properties of database transactions. In the context of databases, a single logical operation on the data is called a transaction."}
{"id":"2","content":"COBOL","details":"COmmon Business Oriented Language developed for programming business applications. It is still in use in many large companies and governments all over the world. "}
{"id":"1","content":"Java","details":"Java is Object Oriented Programming language running on its own virtual machine. Java class files can run in any hardware operating system"}
{"id":"3","content":"C","details":"C is a general-purpose, imperative computer programming language, supporting structured programming, lexical variable scope and recursion, while a static type system prevents many unintended operations. By design, C provides constructs that map efficiently to typical machine instructions, and therefore it has found lasting use in applications that had formerly been coded in assembly language, including operating systems, as well as various application software for computers ranging from supercomputers to embedded systems.."}
{"id":"4","content":"C++","details":" C++ is an Object Oriented Language used for developing application and engines. C++ uses pointers and destroyers as opposed to Java.  "}
{"id":"7","content":"CPU","details":"Central Process(ing) Unit - the electronic circuitry within a computer that carries out the instructions of a computer program by performing the basic arithmetic, logical, control and input/output (I/O) operations specified by the instructions."}
{"id":"5","content":"Objective C","details":"Apple's Language for iPhone/iPad Applications. Used for mobile applications on Apple devices. "}
{"id":"6","content":"OOP","details":"Object Oriented Programming - the 4 major principles that make a language object-oriented: Encapsulation, Data Abstraction, Polymorphism and Inheritence."}
{"id":"7","content":"LDAP","details":"The Lightweight Directory Access Protocol is an open, vendor-neutral, industry standard application protocol for accessing and maintaining distributed directory information services over an Internet Protocol (IP) network. "}
{"id":"8","content":"PASCAL","details":"Pascal is a historically influential imperative and procedural programming language, designed in 1968–69 and published in 1970 by Niklaus Wirth as a small and efficient language intended to encourage good programming practices using structured programming and data structuring."}
{"id":"9","content":"FORTRAN","details":"FORmula TRANslation is a language used in Mathematics which converts math formulae into code. the FORTRAN was developed by a team of programmers at IBM led by John Backus, and was first published in 1957."}
{"id":"10","content":"RAM","details":"Random Access Memory (RAM) is a form of computer data storage. A random-access memory device allows data items to be accessed (read or written) in almost the same amount of time irrespective of the physical location of data inside the memory"}
{"id":"11","content":"RDBMS","details":"Relational Database Management System (RDBMS) is a database management system (DBMS) that is based on the relational model as invented by E. F. Codd, of IBM's San Jose Research Laboratory"}
{"id":"12","content":"NoSQL Database","details":"NoSQL (originally referring to 'Not Only SQL' or 'Not-Only Structured Query Language') database provides a mechanism for storage and retrieval of data which is modeled in means other than the tabular relations used in relational databases. E.g. MongoDB, Cassandra, CouchDB,MemCached,HBase"}
{"id":"44","content":"BASIC","details":"Beginners All-purpose Symbolic Instruction Code (BASIC) is simple language based on sequential line number execution. "}
{"id":"45","content":"Visual Basic","details":"Visual BASIC (Beginners All-purpose Symbolic Instruction Code (BASIC)) is Microsoft language designed to create GUI based applications for MS Operating System. "}
{"id":"47","content":"OS","details":"OS - Operating System for example like UNIX, DOS, Linux, PC_DOS etc.  "}
{"id":"48","content":"DOS","details":"Disk Operating System (DOS) from Microsoft was formerly called MS-DOS. OS - Operating System for example like UNIX, DOS, Linux, PC_DOS etc.  "}
{"id":"49","content":"UNIX","details":"UNIX is an operating system which one of multitasking, multiuser computer systems that derive from the original AT&T Unix, developed in the 1970s at the Bell Labs research center by Ken Thompson, Dennis Ritchie, and others. "}
{"id":"989","content":"Angular JS","details":"Google product for developing rich client based web applications in Java Script (JS). "}
{"id":"51","content":"JavaScript","details":"JavaScript is a scripting based language used to define functions in the browser.  "}
{"id":"50","content":"VB Script","details":"Visual Basic (VB) Script is using VB flavor in HTML pages for defining functions. "}
{"id":"55","content":"HTML","details":"Hyper Text Markup Language -  is the standard markup language used to create web pages. Along with CSS, and JavaScript, HTML is a cornerstone technology used to create web pages, as well as to create user interfaces for mobile and web applications. "}
{"id":"77","content":"FTP","details":"File Transfer Protocol is method to transfer to files between two remote systems. Generally over port number 23. "}
{"id":"78","content":"VPN","details":"Virtual Private Network is a protocol between two network to create a secure tunnel to access the remote network sensitive data, files and other assets. "}
{"id":"79","content":"Spring Framework","details":"Spring framework consists of many modules - Core, MVC, Security, Batch, etc.  "}
{"id":"47","content":"Application Server","details":"An application server manages database pool connection, sessions, security for applications which are developed to execute on these application servers like tomcat, JBOSS, Weblogic, Jetty etc.   "}
{"id":"99","content":"Hibernate","details":"Hibernate is a method to map database table results to an object (Java or Visual C or any other language). It is also called an ORM tool for mapping.  "}
{"id":"71","content":"ORM","details":"Object Relational Mapping (ORM) tool is used ot map results from a relational database to an program object. This enables a link between the application and table; reducing develpment code.  "}
