{"id":"1","content":"Chinta","details":"Worry, think. Can also be thought depending on the usage of the word. "}
{"id":"2","content":"Uma","details":" Dawn, and also Parvati's name. Used as a woman's first name. "}
{"id":"3","content":"Vedas ","details":"Vedas:  literally means, 'knowledge'; applies to the entire collection of Indian sacred literature. Four known Rig Veda, Sama Veda, Atharva Veda and Yajur veda "}
{"id":"4","content":"Shiva","details":"One of the trinity Gods, also referred to as the Destroyer, Lord of Dance(Nataraaja)"}
{"id":"7","content":"Ganesha/Ganesh","details":"Half Elephant-Half Man God. Son of Shiva and Parvati. Known as remover of obstacles. In Hinduism before any prayer is said to other Gods, he invoked to remove obstacles "}
{"id":"5","content":"Parvathi/Parvati","details":"Consort/wife of Shiva. Mother of Ganesh and Dattatreya. She took some incarnations to rid evil on earth and heaven(swarga). Most famous is Durga"}
{"id":"6","content":"Brahma","details":"One of the Gods in Hindu God Trinity. Brahma is the creator of the universe. He sits on a lotus. The lotus emerges from Vishnu."}
{"id":"13","content":"Vishnu","details":"One of the Gods in Hindu God Trinity. Vishnu is attibuted to be the protector or preserver of the universe. He has incarnated himself 9 times and it is said his 10th incrnation (avataar) is yet to come. "} "}
{"id":"8","content":"Saraswati","details":"Wife and consort of Brahma. She is the godess of learning and is invoked before students study or embark upon on a new leaarning. "}
{"id":"9","content":"Raama/Rama/Ram","details":"The main character in the hindu epic Ramayana. Rama was married to Seeta and fulfilled his father's banishment in the forest for 14 years and returned to his kingdom. He is the 7th incarnation of Vishnu"}
{"id":"10","content":"Hanuman","details":"Also, known as the Monkey god. He occurs in both epics of Ramayana and Mahabharata hindu epics. He is known to be first devotee of Lord Rama"}
{"id":"11","content":"Seeta/Sita","details":"Seeta is the wife of Raama in Raamayana. She is the daughter of King Janaka. "}
{"id":"12","content":"Krishna","details":"The 8th of avataar of Vishnu, who came down to rid earth of evil doers and establish dharma. He gave the discourse to Arjuna in Bhagavad Geeta."}
{"id":"14","content":"Moksha ","details":" moksha:  release from the cycle of death and rebirth in Indian religions; liberation "}
{"id":"15","content":"Upanishads","details":" Hindu literature and philosophy &&& Dawn, and also Parvati's name. Used as a woman's first name. "}
{"id":"16","content":"Bhakti" ,"details":"Hindu concept of devotional service to a personal god.  Bhakti-yoga is one of the principal paths to liberation taught in Hinduism."}
{"id":"17","content":"Nitya" ,"details":" Sanskrit meaning “eternal” or “permanent.” Its opposite is anitya, which refers to the Hindu concept of impermanence. Yogi must overcome overcome anitya by finding the nitya (permanence) within oneself."}
{"id":"18","content":"Darshan" ,"details":"to see, to view. Used extensively for having a view of the Lord in a temple. e.g. Have you had darshan of Lord Shiva?"}
{"id":"19","content":"Yukta" ,"details":"Sanskrit meaning set to work, made use of, employed, occupied with, engaged in,"}
{"id":"20","content":"Vairagya" ,"details":"Sanskrit term used in Hindu philosophy that roughly translates as dispassion, detachment, or renunciation, in particular renunciation from the pains and pleasures in the material world"}
{"id":"21","content":"Shraddha/Shradda" ,"details":"Faith. Also, a woman's name."}
{"id":"22","content":"Saburi" ,"details":"Patience. "}
{"id":"23","content":"Abhi" ,"details":"Sanskrit meaning is completely. "}
{"id":"24","content":"Nigraha" ,"details":"Sansrkit meaning destroy. Buddha states that one must kill the very source of one's difficulties and he uses the word abhinigraha - completely destroy."}
{"id":"25","content":"Karma" ,"details":"Karma means action, work or deed; it also refers to the spiritual principle of cause and effect where intent and actions of an individual (cause) influence the future of that individual (effect). Good intent and good deed contribute to good karma and future happiness, while bad intent and bad deed contribute to bad karma and future suffering."}
{"id":"26","content":"Dharma" ,"details":"The  sanskrit word dharma  is found in Hindu and Jain teachings, and Dhamma (in Pali) is found in Buddhist religion. Its original meaning is something like 'natural law''. Its root word, dham, means 'to uphold'' or 'to support''. In this broad sense common to many religious traditions, dharma is that which upholds the natural order of the universe "}
{"id":"27","content":"Navan" ,"details":"Nickname for Krishna as navanithachor means theif of butter. However, another meaning is nine jewels or Lord of the nine planets. In Hinduism they had 9 planets  sun, moon, earth, venus, mars, jupiter,mercury, eclipse, and after eclipse. Used as man's name "}
{"id":"28","content":"Naman" ,"details":"Sanskrit owrd Namona - to bow or prostrate to God. Naman as a person’s name reprenting good fundamental nature  "}
{"id":"29","content":"Shakti" ,"details":"Sanskrit meaning strength, power.  Shakti Devi is another name of Kali Devi an incarnation of Parvati"}
{"id":"30","content":"Aasana/Asana" ,"details":"Sanskrit meaning pose or posture. "}
{"id":"31","content":"Mahabharata/Mahabarata","details":"An epic in Hinduism written by Sage Vyasa. It is the story of two sets of cousins who fight for their share of kingdom. According to Guinness book, is longest poem in the world. The main characters are Pandavas, Kauravas and Krishna   "}
{"id":"32","content":"Matsya Avataar" ,"details":" Sanskrit meaning is Fish. Matsya avaatar is the incarnation of Lord Vishnu and is the first of his incarnations on earth to save earth and humanity. The Matsya avataar saved the earth and humanity from great flood "}
{"id":"33","content":"Ravi" ,"details":"Sanskrit meaning sun. used as a man's name. Sometimes they are named as Ravindra or RaviLochan( eyes like the sun) "}
{"id":"34","content":"Yoga" ,"details":"he word 'yoga'' comes from the Sanskrit root yuj,  which means 'to join'' or 'to yoke''."}
{"id":"35","content":"Varaha Avataar" ,"details":"Varaha means two tusked boar. Hiranyaksha wanted a fight with God and searched for Lord Vishnu. As he could not find Lord Vishnu,so he snatched the earth, and carried it to the bottom of the ocean. Varaha Varaha challenged Hiranyaksha, defeated him and then carried the Earth out of the ocean between his tusks.Varaha Avataar restored it to its place in the universe.   "}
{"id":"37","content":"Kurma/Koorma Avataar" ,"details":"Sansrkit meaning Tortoise which is the 2nd incarnation of Lord Vishnu. Kurma Avataar helped the devas churn the ocean of plenty (or ocean of milk), by becoming the base for the churning rod.  "}
{"id":"38","content":"Vaamana Avataar" ,"details":"Vaamana means dwarf. In this Avaatar, Lord Vishnu comes down as a dwarf to rid of an evil king who had conquered heaven and earth.   "}
{"id":"36","content":"Avataar" ,"details":"Sanskrit meaning incarnation. It is now commonly used in video games by gamers. "}
{"id":"39","content":"Narasimha Avataar" ,"details":"Nara means man and Simha means lion. In this avataar, Lord Vishnu rids the earth of evil king. This king could only be killed by half man and half animal. "}
{"id":"40","content":"Budhha Avataar" ,"details":"Lord Vishnu comes down as Buddha in this 9th avataar to help the earth and humanity to seek englightenment. "}
{"id":"41","content":"Parsurama Avataar" ,"details":"As the earth got over burdened by greedy, narcissitic kings who did not perform their dharma; Lord Vishnu came down as Parsuraama to set the balance of the good and evil on Earth.  "}
{"id":"43","content":"Kalki Avataar" ,"details":"Kalki in sanskrit means 'destroyer of sins'. This is the 10th avataar of Lord Vishnu and is set in the future. It is a Hindu belief that when the evil tips more than good on earth; this avataar will come down to earth to set the balance right.  "}
{"id":"44","content":"Arjuna/Arjun","details":"Arujuna is the 3rd Pandava in the epic Mahabharata. Lord Krishna imparts the knowledge of Bhagavad Geeta to him on the Kurukshetra Battlefield. Arujuna is the son of Kunti and Indra (king of devas). The oldest Pandava is Yudhistera, next Bheema and after Arjuna are twins Nakul and Sahdeva.   "}
{"id":"45","content":"Rajeev","details":"Sanskrit meaning blue lotus. Raama and Krishna were of a bluish hue and it means divine or rare.  "}
{"id":"46","content":"Kalyani","details":"Another name for Parvati"}
{"id":"47","content":"Uma","details":"Sanskrit meaning is dawn and is another name for Parvati.  Also a woman's name. "}
{"id":"48","content":"Radha","details":"Radha is a consort of Krishna. She is one of the Gopikas; however the favorite of Lord Krishna."}
{"id":"71","content":"Lakshmi/Laxmi","details":"Wife of Vishnu. Godess of fortune, wealth and goodness. She sometimes accompanies Vishnu on his incarnations to earth.  "}
{"id":"119","content":"Atma/Aatma","details":"Literally soul. Means the spirit in every living thing not just humans. "}
{"id":"111","content":"Preya","details":"sensual realates to immediate gratification"}
{"id":"120","content":"Om/Aum","details":"Om, Aum is the primary sounds combined according to the hindu lore. It is utterance of 3 sounds namely Aah, Ooo and Mmm. Combined together they form the sounds Aum. Also, used for hailing the lord. "}
{"id":"117","content":"Brahman","details":"Brahman means the complete spirit which all individual spirits (atmans) finally merge. "}
{"id":"122","content":"Brahmin","details":"Brahmin is one of the caste system as stated by Manu in his treatise of ManuSmriti. Brahmin cast comprises the priests of hinduism."}
{"id":"116","content":"Bhagavad Geeta/Gita","details":"The Bhagvaad Geeta/Gita is the discourse given by Lord Krishna to Arjuna during the battle of Kurukshetra. The Geeta is a subset of chapters in the eipic Mahabharatha"}
{"id":"115","content":"Shreya","details":"that which implemented gives long term benefit"}
{"id":"114","content":"Jyothi","details":"A lamp. Also, a woman's name. "}
{"id":"113","content":"Deep/Deepa/Deepak/Deepali","details":"A lamp. Deep and Deepak are male names while Deepa, Deepali are woman's names"}
{"id":"112","content":"Gnayn","details":"Gnayan is wisdom. "}
{"id":"1967","content":"Prerna","details":"Inspiration. Also used as woman's first name; as wife. "}
{"id":"1969","content":"Lingam","details":"Symbol of Shiva made of stone. "}
{"id":"1968","content":"Ahimsa","details":"Non Violence - practice of non violence in action, speech and thought. "}
{"id":"1970","content":"Vidya","details":"Vidya is knowledge. It is also used as a woman's first name. Antonym: aVidya - ignorance "}
