{"id":"119","content":"ANSI","details":"The American National Standards Institute (ANSI, /ˈænsi/ an-see) is a private non-profit organization that oversees the development of voluntary consensus standards for products, services, processes, systems, and personnel in the United States.[3] The organization also coordinates U.S. standards with international standards so that American products can be used worldwide."}
{"id":"118","content":"ASCII","details":"ASCII (Listeni/ˈæski/ ass-kee),[1]:6 abbreviated from American Standard Code for Information Interchange, is a character encoding standard (the Internet Assigned Numbers Authority (IANA) prefers the name US-ASCII[2]). ASCII codes represent text in computers, telecommunications equipment, and other devices."}
{"id":"117","content":"JSON","details":"JSON (JavaScript Object Notation) is a lightweight data-interchange format. It is easy for humans to read and write. It is easy for machines to parse and generate. An example {{'firstName':'Inigo '},{ 'lastName':'Montoya'}}"}
{"id":"116","content":"EJB","details":"Enterprise Java Beans consist of Entity Beans, Session Beans and Message Beans which execute on application servers."}
{"id":"115","content":"ERD","details":"Entity Relation Diagram describes inter-related things of interest in a specific domain of knowledge. An ER model is composed of entity types (which classify the things of interest) and specifies relationships that can exist between instances of those entity types."}
{"id":"114","content":"JWT","details":"JSON Web Token (JWT) is an open standard (RFC 7519) that defines a compact and self-contained way for securely transmitting information between parties as a JSON object"}
{"id":"113","content":"JVM","details":"Java Virtual Machine which runs on all operating systems. Applications written in languages compatible in JVM execute seamlessly in any operating systems"}
{"id":"112","content":"SLO","details":"Single Log On (SLO) allows a user be authenticated to various applications in a network without signing in with uid and password.As opposed to Single Sign On this doesnot include authorization  "}
{"id":"111","content":"SSO","details":"Single Sign On (SSO) allows a user to logon to various applications in a network without signing in with uid and password. Authentication and authorization is done via a directory server which is separate from application and web server.  "}
{"id":"0","content":"ADA","details":"ADA is a machine level language named after the first programmer Ada. Ada was the coder for Charles Babbage"}
{"id":"1","content":"ACID","details":"ACID (Atomicity, Consistency, Isolation, Durability) is a set of properties of database transactions. In the context of databases, a single logical operation on the data is called a transaction."}
{"id":"2","content":"COBOL","details":"COmmon Business Oriented Language developed for programming business applications. It is still in use in many large companies and governments all over the world. "}
{"id":"1","content":"Java","details":"Java is Object Oriented Programming language running on its own virtual machine. Java class files can run in any hardware operating system"}
{"id":"3","content":"C","details":"C is a general-purpose, imperative computer programming language, supporting structured programming, lexical variable scope and recursion, while a static type system prevents many unintended operations. By design, C provides constructs that map efficiently to typical machine instructions, and therefore it has found lasting use in applications that had formerly been coded in assembly language, including operating systems, as well as various application software for computers ranging from supercomputers to embedded systems.."}
{"id":"4","content":"C++","details":" C++ is an Object Oriented Language used for developing application and engines. C++ uses pointers and destroyers as opposed to Java.  "}
{"id":"7","content":"CPU","details":"Central Process(ing) Unit - the electronic circuitry within a computer that carries out the instructions of a computer program by performing the basic arithmetic, logical, control and input/output (I/O) operations specified by the instructions."}
{"id":"5","content":"Objective C","details":"Apple's Language for iPhone/iPad Applications. Used for mobile applications on Apple devices. "}
{"id":"6","content":"OOP","details":"Object Oriented Programming - the 4 major principles that make a language object-oriented: Encapsulation, Data Abstraction, Polymorphism and Inheritence."}
{"id":"7","content":"LDAP","details":"The Lightweight Directory Access Protocol is an open, vendor-neutral, industry standard application protocol for accessing and maintaining distributed directory information services over an Internet Protocol (IP) network. "}
{"id":"8","content":"PASCAL","details":"Pascal is a historically influential imperative and procedural programming language, designed in 1968–69 and published in 1970 by Niklaus Wirth as a small and efficient language intended to encourage good programming practices using structured programming and data structuring."}
{"id":"9","content":"FORTRAN","details":"FORmula TRANslation is a language used in Mathematics which converts math formulae into code. the FORTRAN was developed by a team of programmers at IBM led by John Backus, and was first published in 1957."}
{"id":"10","content":"RAM","details":"Random Access Memory (RAM) is a form of computer data storage. A random-access memory device allows data items to be accessed (read or written) in almost the same amount of time irrespective of the physical location of data inside the memory"}
{"id":"11","content":"RDBMS","details":"Relational Database Management System (RDBMS) is a database management system (DBMS) that is based on the relational model as invented by E. F. Codd, of IBM's San Jose Research Laboratory"}
{"id":"12","content":"NoSQL Database","details":"NoSQL (originally referring to 'Not Only SQL' or 'Not-Only Structured Query Language') database provides a mechanism for storage and retrieval of data which is modeled in means other than the tabular relations used in relational databases. E.g. MongoDB, Cassandra, CouchDB,MemCached,HBase"}
{"id":"44","content":"BASIC","details":"Beginners All-purpose Symbolic Instruction Code (BASIC) is simple language based on sequential line number execution. "}
{"id":"45","content":"Visual Basic","details":"Visual BASIC (Beginners All-purpose Symbolic Instruction Code (BASIC)) is Microsoft language designed to create GUI based applications for MS Operating System. "}
{"id":"47","content":"OS","details":"OS - Operating System for example like UNIX, DOS, Linux, PC_DOS etc.  "}
{"id":"48","content":"DOS","details":"Disk Operating System (DOS) from Microsoft was formerly called MS-DOS. OS - Operating System for example like UNIX, DOS, Linux, PC_DOS etc.  "}
{"id":"49","content":"UNIX","details":"UNIX is an operating system which one of multitasking, multiuser computer systems that derive from the original AT&T Unix, developed in the 1970s at the Bell Labs research center by Ken Thompson, Dennis Ritchie, and others. "}
{"id":"989","content":"Angular JS","details":"Google product for developing rich client based web applications in Java Script (JS). "}
{"id":"51","content":"JavaScript","details":"JavaScript is a scripting based language used to define functions in the browser.  "}
{"id":"50","content":"VB Script","details":"Visual Basic (VB) Script is using VB flavor in HTML pages for defining functions. "}
{"id":"55","content":"HTML","details":"Hyper Text Markup Language -  is the standard markup language used to create web pages. Along with CSS, and JavaScript, HTML is a cornerstone technology used to create web pages, as well as to create user interfaces for mobile and web applications. "}
{"id":"77","content":"FTP","details":"File Transfer Protocol is method to transfer to files between two remote systems. Generally over port number 23. "}
{"id":"78","content":"VPN","details":"Virtual Private Network is a protocol between two network to create a secure tunnel to access the remote network sensitive data, files and other assets. "}
{"id":"79","content":"Spring Framework","details":"Spring framework consists of many modules - Core, MVC, Security, Batch, etc.  "}
{"id":"47","content":"Application Server","details":"An application server manages database pool connection, sessions, security for applications which are developed to execute on these application servers like tomcat, JBOSS, Weblogic, Jetty etc.   "}
{"id":"99","content":"Hibernate","details":"Hibernate is a method to map database table results to an object (Java or Visual C or any other language). It is also called an ORM tool for mapping.  "}
{"id":"71","content":"ORM","details":"Object Relational Mapping (ORM) tool is used ot map results from a relational database to an program object. This enables a link between the application and table; reducing develpment code.  "}
{"id":"472","content":"JDBC","details":"Java DataBase Connection is a protocol to connect from a JVM language to a Database. This java connection is based on ODBC."}
{"id":"473","content":"Groovy","details":"Groovy is a JVM language based on Java however, has an easy learning curve and replaces java's issue with simple functions and syntax. "}
{"id":"147","content":"DRAM","details":"Dynamic random-access memory (DRAM) is a type of random-access memory that stores each bit of data in a separate capacitor within an integrated circuit. The capacitor can be either charged or discharged; these two states are taken to represent the two values of a bit, conventionally called 0 and 1.It loses its storage when powered down. "}
{"id":"277","content":"XML","details":"eXtreme Markup Language is a superset of  other XML language like HTML, MXML, etc.  "}
{"id":"278","content":"WWW","details":"The World Wide Web (WWW) is an information space where documents and other web resources are identified by URLs, interlinked by hypertext links, and can be accessed via the Internet.[1] The World Wide Web was invented by English scientist Tim Berners-Lee in 1989. He wrote the first web browser in 1990 while employed at CERN in Switzerland. "}
{"id":"279","content":"SOAP","details":"SOAP (Simple Object Access Protocol) is a protocol specification for exchanging structured information in the implementation of web services in computer networks. It uses XML Information Set for its message format, and relies on application layer protocols, most often Hypertext Transfer Protocol (HTTP) or Simple Mail Transfer Protocol (SMTP), for message negotiation and transmission"}
{"id":"280","content":"REST(ful) services","details":"REST stands for Representational State Transfer, which is an architectural style for networked hypermedia applications, it is primarily used to build Web services that are lightweight, maintainable, and scalable. A service based on REST is called a RESTful service"}
{"id":"281","content":"IRIX","details":"IRIX is a discontinued operating system developed by Silicon Graphics (SGI) to run natively on their MIPS workstations and servers. It is based on UNIX System V with BSD extensions. IRIX was the first operating system to include the XFS file system."}
{"id":"282","content":"ROM","details":"Read-only memory (ROM) is a type of non-volatile memory used in computers and other electronic devices. Data stored in ROM can only be modified slowly, with difficulty, or not at all, so it is mainly used to store firmware (software that is closely tied to specific hardware and unlikely to need frequent updates) or application software in plug-in cartridges."}
{"id":"283","content":"LINUX","details":"Linux is a Unix-like and mostly POSIX-compliant computer operating system (OS) assembled under the model of free and open-source software development and distribution. The defining component of Linux is the Linux kernel, an operating system kernel first released on October 5, 1991 by Linus Torvalds."}
{"id":"284","content":"POSIX","details":"Portable Operating System Interface (POSIX) is a family of standards specified by the IEEE Computer Society for maintaining compatibility between operating systems. POSIX defines the application programming interface (API), along with command line shells and utility interfaces, for software compatibility with variants of Unix and other operating systems"}
{"id":"285","content":"BIT","details":"Binary digIT (BIT) is a digit expressed in 0 and 1. The bit is a basic unit of information in computing and digital communications. A bit can have only one of two values, and may therefore be physically implemented with a two-state device."}
{"id":"286","content":"BYTE","details":"The byte is a unit of digital information that most commonly consists of eight bits. Historically, the byte was the number of bits used to encode a single character of text in a computer and for this reason it is the smallest addressable unit of memory in many computer architectures."}
{"id":"287","content":"Binary","details":"In mathematics and digital electronics, a binary number is a number expressed in the binary numeral system or base-2 numeral system which represents numeric values using two different symbols: typically 0 (zero) and 1 (one)."}
{"id":"288","content":"RAILS/RoR/Ruby on Rails","details":"  Rails, is a web application framework written in Ruby under the MIT License. Rails is a model–view–controller (MVC) framework, providing default structures for a database, a web service, and web pages. It encourages and facilitates the use of web standards such as JSON or XML for data transfer, and HTML, CSS and JavaScript for display and user interfacing. In addition to MVC, Rails emphasizes the use of other well-known software engineering patterns and paradigms, including convention over configuration (CoC), don't repeat yourself (DRY), and the active record pattern."}
{"id":"289","content":"Grails","details":"Groovy on Rails (see Rails)"}
{"id":"290","content":"ODBC","details":"Open Database Connectivity (ODBC) is an open standard application programming interface (API) for accessing a database. By using ODBC statements in a program, you can access files in a number of different databases, including Access, dBase, DB2, Excel, and Text."}
{"id":"291","content":"Hexadecimal","details":"In mathematics and computing, hexadecimal (also base 16, or hex) is a positional numeral system with a radix, or base, of 16. It uses sixteen distinct symbols, most often the symbols 0–9 to represent values zero to nine, and A, B, C, D, E, F (or alternatively a, b, c, d, e, f) to represent values ten to fifteen. Hexadecimal numerals are widely used by computer system designers and programmers. Several different notations are used to represent hexadecimal constants in computing languages; the prefix "0x" is widespread due to its use in Unix and C"}
{"id":"292","content":"ZIP file","details":"A type of compression using zip applicaiton which compresses disk space occupied by files into a .zip file extension"}
{"id":"293","content":"JAR file","details":"Java Archive Resource contains compressed java classes which can be ported into another application. This is an implementation of  Don't Repeat Yourself(DRY) method"}
{"id":"294","content":"Text file","details":"A file which has data generally separated by a special character (comma,pipe etc). These files can end .txt or an extension of the user choice. e.g. 'sarma,kuruganti,USA;raj, patel, India;Sujatha,Dey, UK'"}
{"id":"295","content":"IDE","details":"Interactive Developer Environment (IDE) is a software application that provides comprehensive facilities to computer programmers for software development. e.g. Eclipse, Aptana, IntelliJ, Brackets, Visual .Net"}
{"id":"296","content":"DRY","details":"In software engineering, don't repeat yourself (DRY) is a principle of software development, aimed at reducing repetition of information of all kinds, especially useful in multi-tier architectures"}
{"id":"297","content":"WAR file","details":"Web Archive Resource contains compressed web resource files and directories. The file can also contains jar files.  This file with extension .war can be deployed on web or application server. "}
{"id":"298","content":"EAR file","details":"Enterprise Archive Resource contains compressed web resource files, java classes, resources- imaages, videos and directories. This file with extension .ear contains .jar files .war files and some other configuration specific files. These can be deployed on any web application server"}
{"id":"301","content":"GZ file","details":"gz is a short form of tar.gz files which are used in UNIX, Linux operating systems. These consist of TAR file with extension of .tar which can be uncompressed. "}
{"id":"300","content":"TAR file","details":"Source code is often packed for download as a TAR (Tape ARchive) file, that is a standard format in the Unix/Linux world. These files have a .tar extension."}
{"id":"299","content":"Web Server","details":"A Web server is a program that uses HTTP (Hypertext Transfer Protocol) to serve the files that form Web pages to users, in response to their requests, which are forwarded by their computers' HTTP clients"}
{"id":"302","content":"JSP","details":"Java Server Pages (JSP)are HTML pages containing a reference to Java servlets, or, java server side applets. JSP files help to deliver server side customized content on a webpage through servlets. "}
{"id":"303","content":"MVC","details":"Model View Controller (MVC) is a software architectural pattern for implementing user interface applications on a computer. It divides a given software application into three interconnected parts- model stores the data (database), view is the user view and controller interprets each request from view to model and vice-versa."}
{"id":"201","content":"Version Control","details":"Version control is a system that records changes to a file or set of files over time so that you can recall specific versions later. Some examples are Visual Source Safe (VSS), CVS (Concurrent Version System), SVN (Sub VersioN), and GIT."}
{"id":"202","content":"sed","details":"sed (stream editor) is a non-interactive command-line text editor"}
{"id":"203","content":"awk","details":"awk is an interpreted programming language designed for text processing and typically used as a data extraction and reporting tool. It is a standard feature of most Unix-like operating systems. Other flavors are NAWK, GAWK"}
{"id":"204","content":"python","details":"Python is a programming language that lets you work quickly and integrate systems more effectively"}
{"id":"205","content":"perl","details":"Perl is a family of high-level, general-purpose, interpreted, dynamic programming languages."}
{"id":"206","content":"Jython","details":"A hybrid of java and python languages which allows python programs to call java classes and methods. "}
{"id":"207","content":"Oracle Database","details":"Oracle Database (commonly referred to as Oracle RDBMS or simply as Oracle) is an object-relational database management system[3] produced and marketed by Oracle Corporation."}
{"id":"208","content":"MySQL","details":"MySQL is an open-source relational database management system (RDBMS)."}
{"id":"209","content":"SQL","details":"Structured Query Language (SQL) is a special-purpose programming language designed for managing or for stream processing data which is held in a relational database management system (RDBMS). "}
{"id":"210","content":"H2 Database","details":"H2 is a relational database management system written in Java. It can be embedded in Java applications or run in the client-server mode. "}
{"id":"211","content":"Shell Scripting","details":"A shell script is a computer program designed to be run by the Unix shell, a command-line interpreter. The various dialects of shell scripts are considered to be scripting languages. Typical operations performed by shell scripts include file manipulation, program execution, and printing text. e.g. z-shell, korn-shell, bash, bourne-shell."}
{"id":"212","content":"SPA","details":"Single Page Application (SPA) is a design in software application so that same web site/application can be deployed on multiple clients like mobile devices and browsers."}
{"id":"213","content":"QA","details":"Quality and Assurance (QA). A team which tests the application developed by programmers before it is released into production. This prevents in buggy code making into production environment. "}
{"id":"214","content":"Offshore","details":"Offshore means development or other IT functions are done in another country (like India, Phillipines etc). Onshore means the users and developers are in the same country."}
{"id":"215","content":"NearShore","details":"NearShore means development or other IT functions are done in same time zone give or take about 3 or 4 hours. NearShore can mean another country like Mexico, Argentina etc. Onshore means the users and developers are in the same country. "}
{"id":"216","content":"JRE","details":"Java Runtime Environment (JRE) provides the libraries, the Java Virtual Machine, and other components to run applets and applications written in the Java programming language. "}
{"id":"217","content":"JDK","details":"The Java Development Kit (JDK) is an implementation of either one of the Java Platform, Standard Edition, Java Platform, Enterprise Edition or Java Platform, Micro Edition platforms released by Oracle Corporation in the form of a binary product aimed at Java developers on Solaris, Linux, Mac OS X or Windows. The JDK includes a private JVM and a few other resources to finish the development of a Java Application"}
{"id":"218","content":"SDK","details":"A software development kit (SDK or "devkit") is typically a set of software development tools that allows the creation of applications for a certain software package, software framework, hardware platform, computer system, video game console, operating system, or similar development platform. To create applications, you have to download a specific software development kit. e.g. Android SDK, iOS SDK, Windows SDK"}
{"id":"219","content":"iOS","details":"iOS (originally iPhone OS) is a mobile operating system created and developed by Apple Inc. and distributed exclusively for Apple hardware. It is the operating system that presently powers many of the company's mobile devices, including the iPhone, iPad, and iPod touch"}
{"id":"221","content":"MainFrame","details":"Mainframe computers are computers used primarily by large organizations for critical applications, bulk data processing such as census, industry and consumer statistics, enterprise resource planning, and transaction processing."}
{"id":"222","content":"Colo or Colocation","details":"A colocation centre (also spelled co-location, or colo) is a type of data centre where equipment, space, and bandwidth are available for rental to retail customers. They are sometimes also referred to as "carrier hotels." Colocation facilities provide space, power, cooling, and physical security for the server, storage, and networking equipment of other firms—and connect them to a variety of telecommunications and network service providers—with a minimum of cost and complexity."}
{"id":"223","content":"Network","details":"A network or computer network or data network is a telecommunications network which allows computers to exchange data. In computer networks, networked computing devices exchange data with each other using a data link. The connections between nodes are established using either cable media or wireless media. The best-known computer network is the Internet."}
{"id":"224","content":"Internet","details":"The Internet is the global system of interconnected computer networks that use the Internet protocol suite (TCP/IP) to link billions of devices worldwide. It is a network of networks that consists of millions of private, public, academic, business, and government networks of local to global scope, linked by a broad array of electronic, wireless, and optical networking technologies."}
{"id":"225","content":"Email","details":"Electronic mail is a method of exchanging digital messages between computer users; such messaging first entered substantial use in the 1960s and by the 1970s had taken the form now recognised as email. Email operates across computer networks, now primarily the Internet."}
{"id":"226","content":"Online","details":"The terms 'online' and 'offline' have specific meanings in regard to computer technology and telecommunications in which "online" indicates a state of connectivity, while "offline" indicates a disconnected state. Common vernacular extended from their computing and telecommunication meanings and refers specifically to an Internet connection."}
{"id":"227","content":"Offline","details":"The terms 'online' and 'offline' have specific meanings in regard to computer technology and telecommunications in which "online" indicates a state of connectivity, while "offline" indicates a disconnected state. Common vernacular extended from their computing and telecommunication meanings and refers specifically to an Internet connection."}
{"id":"228","content":"Swift","details":"Swift is a general-purpose, multi-paradigm, compiled programming language created for iOS, macOS, watchOS, tvOS, and Linux developed by Apple Inc."}
{"id":"229","content":"SMTP","details":"Simple Mail Transfer Protocol (SMTP) is an Internet standard for electronic mail (email) transmission. First defined by RFC 821 in 1982, it was last updated in 2008 with the Extended SMTP additions by RFC 5321—which is the protocol in widespread use today."}
{"id":"230","content":"Cocoa","details":"Cocoa is Apple's native object-oriented application programming interface (API) for their operating system OS X.For iOS, tvOS, and watchOS, a similar API exists, named Cocoa Touch, which includes gesture recognition, animation, and a different set of graphical control elements."}
{"id":"231","content":"TCP","details":"Transmission Control Protocol (TCP) is a core protocol of the Internet protocol suite. It originated in the initial network implementation in which it complemented the Internet Protocol (IP). "}
{"id":"232","content":"IP","details":"The Internet Protocol (IP) is the principal communications protocol in the Internet protocol suite for relaying datagrams across network boundaries. Its routing function enables internetworking, and essentially establishes the Internet.IP has the task of delivering packets from the source host to the destination host solely based on the IP addresses in the packet headers. For this purpose, IP defines packet structures that encapsulate the data to be delivered"}
{"id":"233","content":"GUI","details":"In computer science, a graphical user interface (GUI), is a type of user interface (UI) that allows users to interact with electronic devices through graphical icons and visual indicators such as secondary notation, instead of text-based user interfaces, typed command labels or text navigation."}
{"id":"300","content":"SOA","details":"Service Oriented Architecture (SOA) is an evolution of distributed computing based on the request/reply design paradigm for synchronous and asynchronous applications. An application's business logic or individual functions are modularized and presented as services for consumer/client applications."}
{"id":"301","content":"OLTP","details":"On Line Transaction Processing, or OLTP, is a class of information systems that facilitate and manage transaction-oriented applications, typically for data entry and retrieval transaction processing"}
{"id":"302","content":"BASE","details":"BASE (Basically Available,Soft state,Eventually consistent model accommodates the flexibility offered by NoSQL and similar approaches to the management and curation of unstructured data. Opposite of ACID for OLTP DB Systems"}
{"id":"303","content":"RAID","details":"RAID (redundant array of independent disks) provides a way of storing the same data in different places (thus, redundantly) on multiple hard disks (though not all RAID levels provide redundancy). By placing data on multiple disks, input/output (I/O) operations can overlap in a balanced way, improving performance."}
{"id":"304","content":"Normalized Database","details":"Database normalization, or simply normalization, is the process of organizing the columns (attributes) and tables (relations) of a relational database to minimize data redundancy.The objective is to isolate data so that additions, deletions, and modifications of an attribute can be made in just one table and then propagated through the rest of the database using defined constraints."}
{"id":"305","content":"DDL","details":"Data Definition Language (DDL) is a standard for commands that define the different structures in a database. DDL statements create, modify, and remove database objects such as tables, indexes, and users. Common DDL statements are CREATE, ALTER, and DROP."}
{"id":"306","content":"SDLC","details":"Software (System) Development Life Cycle (SDLC), is a term used in systems engineering, information systems and software engineering to describe a process for planning, creating, testing, and deploying an information system application. 6 Phases are requirement gathering, analysis, design, implementation, testing and evolution"}
{"id":"308","content":"Flash Drive/Memory","details":"A USB flash drive, also commonly known as a USB drive, USB stick and a variety of other names, is a data storage device that includes flash memory with an integrated USB interface. USB flash drives are typically removable and rewritable, and physically much smaller than an optical disc. Some operating systems can be installed from a flash drive instead of a CD or DVD, including various Linux distributions, Windows 7 and newer versions, and OS X."}
{"id":"309","content":"USB","details":"USB, short for Universal Serial Bus, is an industry standard developed in the mid-1990s that defines the cables, connectors and communications protocols used in a bus for connection, communication, and power supply between computers and electronic devices.[4] It is currently developed by the USB Implementers Forum (USB IF)."}
{"id":"310","content":"ETL","details":"Extract, Transform and Load (ETL) data are the 3 major steps when migrating data from one source to another source. Some tools like informatica, MS data transfer and others make it easier to do ETL."}
{"id":"311","content":"Cache","details":"A cache is a hardware or software component that stores data so future requests for that data can be served faster; the data stored in a cache might be the result of an earlier computation, or the duplicate of data stored elsewhere."}
{"id":"312","content":"SaaS","details":"Software as a Service (SaaS) is a software licensing and delivery model in which software is licensed on a subscription basis and is centrally hosted. It is sometimes referred to as 'on-demand software'"}
{"id":"313","content":"PaaS","details":"Platform as a Service (PaaS) is a category of cloud computing services that provides a platform allowing customers to develop, run, and manage applications without the complexity of building and maintaining the infrastructure typically associated with developing and launching an application."}
{"id":"314","content":"Cloud computing","details":"Cloud computing is a kind of Internet-based computing that provides shared processing resources and data to computers and other devices on demand. It is a model for enabling ubiquitous, on-demand access to a shared pool of configurable computing resources (e.g., networks, servers, storage, applications and services), which can be rapidly provisioned and released with minimal management effort."}
{"id":"315","content":"Portal or Web Portal","details":"A web portal is most often one specially designed web site that brings information together from diverse sources in a uniform way. Usually, each information source gets its dedicated area on the page for displaying information (a portlet); often, the user can configure which ones to display. Variants of portals include mashups and intranet 'dashboards' for executives and managers. The extent to which content is displayed in a 'uniform way' may depend on the intended user and the intended purpose, as well as the diversity of the content"}
{"id":"316","content":"Agile","details":"Agile software development is a set of principles for software development in which requirements and solutions evolve through collaboration between self-organizing, cross-functional teams. It promotes adaptive planning, evolutionary development, early delivery, and continuous improvement, and it encourages rapid and flexible response to change"}
{"id":"317","content":"DLL","details":"Dynamic Link Library (DLL) files are with extenskion .dll. A DLL file is a collection of small programs, any of which can be called when needed by a larger program that is running in the computer."}
{"id":"318","content":"Hard Disk Drive - HDD","details":"HDD or hard disk or hard drive is a data storage device used for storing and retrieving digital information using one or more rigid rapidly rotating disks (platters) coated with magnetic material. The platters are paired with magnetic heads arranged on a moving actuator arm, which read and write data to the platter surfaces.[2] Data is accessed in a random-access manner, meaning that individual blocks of data can be stored or retrieved in any order and not only sequentially."}
{"id":"319","content":"GNU","details":"GNU is a recursive acronym for 'GNU's Not Unix!', chosen because GNU's design is Unix-like, but differs from Unix by being free software and containing no Unix code. GNU is an operating system and an extensive collection of computer software. GNU is composed wholly of free software."}
{"id":"320","content":"EULA","details":"In proprietary software, an End-User License Agreement (EULA) or software license agreement is the contract between the licensor and purchaser, establishing the purchaser's right to use the software"}
{"id":"321","content":"IMEI","details":"International Mobile Equipment Identity (IMEI) is a unique number to identify 3GPP and iDEN moble phones. The IMEI number is used by a GSM network to identify valid devices and therefore can be used for stopping a stolen phone from accessing that network. IMEI can be displayed on-screen on most phones by entering *#06# on the dialpad."}
{"id":"322","content":"DMZ","details":"De-Milatarized Zone (DMZ) is a physical or logical sub-network (or network) that separates an internal local area network (LAN) from other untrusted networks, usually the Internet. A term borrowed from army."}
{"id":"323","content":"MAC Address","details":"A media access control address (MAC address) of a computer is a unique identifier assigned to network interfaces for communications at the data link layer of a network segment. MAC addresses are used as a network address for most IEEE 802 network technologies, including Ethernet and WiFi"}
{"id":"324","content":"MAC","details":"MAC OS is a series of graphical user interface–based operating systems developed by Apple Inc. for their MACintosh (MAC) line of computer systems"}
{"id":"325","content":"TOTP","details":"A Time-based One-Time Password (TOTP) is a temporary passcode, generated by an algorithm, for use in authenticating access to computer systems."}
{"id":"326","content":"RSA","details":"RSA is one of the first practical public-key cryptosystems and is widely used for secure data transmission. In such a cryptosystem, the encryption key is public and differs from the decryption key which is kept secret. In RSA, this asymmetry is based on the practical difficulty of factoring the product of two large prime numbers, the factoring problem. RSA is made of the initial letters of the surnames of Ron Rivest, Adi Shamir, and Leonard Adleman, who first publicly described the algorithm in 1977."}
{"id":"327","content":"Framework","details":"A framework is often a layered structure indicating what kind of programs can or should be built and how they would interrelate."}
{"id":"329","content":"ReactJS","details":"React.js or ReactJS is an open-source JavaScript library providing a view for data rendered as HTML. React views are typically rendered using components that contain additional components specified as custom HTML tags"}
{"id":"330","content":"Data Mart","details":"The data mart is a subset of the data warehouse that is usually oriented to a specific business line or team. Data marts are small slices of the data warehouse."}
{"id":"331","content":"Data Warehouse","details":"A data warehouse, also known as an enterprise data warehouse (EDW), is a system used for reporting and data analysis, and is considered as a core component of business intelligence environment. DWs are central repositories of integrated data from one or more disparate sources"}
{"id":"332","content":"API","details":"Application Program Interface (API) is a set of routines, protocols, and tools for building software applications. An API specifies how software components should interact and APIs are used when programming graphical user interface (GUI) components"}
{"id":"333","content":"WYSIWYG","details":"Microsoft terminlogy regarding GUI components What You See Is What You Get (WYSIWYG) means if you see a printer icon then it is printer, a mouse icon is about the mouse device etc. "}
{"id":"334","content":"Client","details":" a desktop computer or workstation that is capable of obtaining information and applications from a server."}
{"id":"335","content":"Server","details":"In computing, a server is a computer program or a device that provides functionality for other programs or devices, called 'clients'. This architecture is called the client–server model, and a single overall computation is distributed across multiple processes or devices. Servers can provide various functionalities, often called 'services', such as sharing data or resources or performing computation for clients. Typical servers are database servers, file servers, mail servers, print servers, web servers, game servers, and application servers."}
{"id":"336","content":"Interface","details":"A boundary across which two independent systems meet and act on or communicate with each other is an interface. In computer technology, example user interface - the keyboard, mouse, menus of a computer system. software interface (the languages and codes that the applications use to interface) and hardware interface "}
{"id":"337","content":"DML","details":"A data manipulation language (DML) is a family of syntax elements similar to a computer programming language used for selecting, inserting, deleting and updating data in a database. Performing read-only queries of data is sometimes also considered a component of DML."}
{"id":"338","content":"SSL","details":"Secure Socket Layer (SSL) is cryptographic protocol that provide communications security over a computer network. Several versions of the protocols find widespread use in applications such as web browsing, email, Internet faxing, instant messaging, and voice-over-IP . Major websites use TLS to secure all communications between their servers and web browsers. "}
{"id":"339","content":"TSL","details":"Transport Socket Layer (TSL) (forerly known as SSL) is a cryptographic protocol that provide communications security over a computer network. Several versions of the protocols find widespread use in applications such as web browsing, email, Internet faxing, instant messaging, and voice-over-IP . Major websites use TLS to secure all communications between their servers and web browsers. "}
{"id":"340","content":"SCP","details":"Secure CoPy or SCP is a means of securely transferring computer files between a local host and a remote host or between two remote hosts. It is based on the Secure Shell (SSH) protocol. The CP in SCP is for copy as cp is command in Unix OS to copy. "}
{"id":"341","content":"SSH","details":"Secure SHell (SSH) is a cryptographic network protocol for operating network services securely over an unsecured network.[1] The best known example application is for remote login to computer systems by users.SSH provides a secure channel over an unsecured network in a client-server architecture, connecting an SSH client application with an SSH server. Common applications include remote command-line login and remote command execution, but any network service can be secured with SSH. The protocol specification distinguishes between two major versions, referred to as SSH-1 and SSH-2."}
{"id":"342","content":"Port ","details":"In the Internet Protocol (IP) suite, a port is an endpoint of communication in an operating system. While the term is also used for hardware devices, in software it is a logical construct that identifies a specific process or a type of network service. A port is always associated with an IP address of a host and the protocol type of the communication, and thus completes the destination or origination address of a communication session."}
{"id":"343","content":"Firewall","details":"A firewall is a network security system, either hardware- or software-based, that controls incoming and outgoing network traffic based on a set of rules.Network firewalls are frequently used to prevent unauthorized Internet users from accessing private networks connected to the Internet, especially intranets. All messages entering or leaving the intranet pass through the firewall, which examines each message and blocks those that do not meet the specified security criteria."}
{"id":"344","content":"Telnet","details":"Telnet is a user command and an underlying TCP/IP protocol for accessing remote computers. Through Telnet, an administrator or another user can access someone else's computer remotely.Generally, on port #23"}
{"id":"345","content":"IEEE","details":"The Institute of Electrical and Electronics Engineers (IEEE, pronounced "I triple E") is a professional association with its corporate office in New York City and its operations center in Piscataway, New Jersey. It was formed in 1963 from the amalgamation of the American Institute of Electrical Engineers and the Institute of Radio Engineers. Today, it is the world's largest association of technical professionals with more than 400,000 members in chapters around the world. Its objectives are the educational and technical advancement of electrical and electronic engineering, telecommunications, computer engineering and allied disciplines."}
{"id":"346","content":"CSV File","details":"Comma Separated Values (CSV) file is an ASCII text file with values separated by commas.Commonly used to transport data between heterogenous systems, databases and applications. The separator can be anyting like | or % or even tabs; however, over time comma has worked well and is general standard. "}
{"id":"347","content":"Neo4j","details":"Neo4j is a graph database management system developed by Neo Technology, Inc. Described by its developers as an ACID-compliant transactional database with native graph storage and processing, Neo4j is the most popular graph database according to db-engines.com."}
{"id":"348","content":"Big Data","details":"Big Data (big data) is extremely large data sets that may be analyzed computationally to reveal patterns, trends, and associations, especially relating to human behavior and interactions."}
{"id":"349","content":"BLOG","details":"A weB LOG (BLOG) is a discussion or informational site published on the World Wide Web consisting of discrete entries ('posts') typically displayed in reverse chronological order (the most recent post appears first)."}
{"id":"350","content":"VLOG","details":"Video bLOG (VLOG), is a form of blog for which the medium is video, and is a form of web television."}
{"id":"351","content":"Webinar","details":"WEB semINAR (webinar) is a seminar conducted over the Internet"}
{"id":"352","content":"PodCast","details":" PODCAST arose as a portmanteau of 'iPod' (a brand of media player) and 'broadcast'. A digital audio file made available on the Internet for downloading to a computer or portable media player, typically available as a series, new installments of which can be received by subscribers automatically."}
{"id":"353","content":"AMQP","details":"The Advanced Message Queuing Protocol (AMQP) is an open standard application layer protocol for message-oriented middleware. The defining features of AMQP are message orientation, queuing, routing (including point-to-point and publish-and-subscribe), reliability and security"}
{"id":"354","content":"Open Source Software","details":"Open-Source Software (OSS) is computer software with its source code made available with a license in which the copyright holder provides the rights to study, change, and distribute the software to anyone and for any purpose. Open-source software may be developed in a collaborative public manner. Open-source software is the most prominent example of open-source development."}
{"id":"355","content":"GNU GPL/GPL","details":"The GNU General Public License (GNU GPL or GPL) is a widely used free software license, which guarantees end users (individuals, organizations, companies) the freedoms to run, study, share (copy), and modify the software. Software that allows these rights is called free software and, if the software is copylefted, requires those rights to be retained. The GPL demands both. The license was originally written by Richard Stallman of the Free Software Foundation (FSF) for the GNU Project"}
{"id":"356","content":"VXML","details":"Voice XML is an XML used for IVR applications. VXML is an HTML derivative and runs on IVR engine which can read the XML and voice it. It has commands to catpure voice responses and direct to another VXML page. It is used mostly by Customer Serivice to route calls and also for trouble shooting customer's issues."}
{"id":"357","content":"IVR","details":"Interactive voice response (IVR) is a technology that allows a computer to interact with humans through the use of voice and DTMF tones input via keypad. "}
{"id":"358","content":"router","details":"A router  is a networking device that forwards data packets between computer networks. Routers perform the traffic directing functions on the Internet. A data packet is typically forwarded from one router to another through the networks that constitute the internetwork until it reaches its destination node"}